"""thirst task"""
import requests


def hw_1():
	names = []
	all_name_list = []
	mentors = [
		["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев",
		 "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина",
		 "Азамат Искаков", "Роман Гордиенко"],
		["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев",
		 "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский",
		 "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов",
		 "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
		["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский",
		 "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая",
		 "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
		["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
		 "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
	]
	for name in mentors:
		all_name_list.extend(name)
	for element in all_name_list:
		res = element.split(" ")
		names.append(res[0])
	names = set(names)
	uniq_names = sorted(names)
	result = ", ".join(uniq_names)
	return result


"""second task: create folder on Yandex disk"""


def create_file():
	token = ""
	url = "https://cloud-api.yandex.net/v1/disk/resources"
	params = {
	"path": "Photo"
	}
	headers = {
		'Content-Type': 'application/json',
		'Authorization': f'OAuth {token}'
	}
	response = requests.put(url, headers=headers, params=params)
	return response.status_code

